Tekla Open API Reference for Tekla Structures 2025
ReferenceModel.SetAsCurrentRevision Method (Int32, Int32)
 Sets the given revision as current revision.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool SetAsCurrentRevision(
	int modelId,
	int revisionId
)
Public Function SetAsCurrentRevision (
	modelId As Integer,
	revisionId As Integer
) As Boolean
Parameters
modelId
Type: System.Int32
The model id, which revision is to be changed.
revisionId
Type: System.Int32
The revision to be set as current.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Tekla.Structures.Model.ReferenceModel.SetAsCurrentRevision(System.Int32,System.Int32)"]
See Also
Reference
ReferenceModel Class
SetAsCurrentRevision Overload
Tekla.Structures.Model Namespace